# -*- eval: (setq org-download-image-dir (concat default-directory "./static/")); -*-
:PROPERTIES:
:ID:       ECF648AF-11C3-4772-96B4-B9C4F0168FB5
:END:
#+LATEX_CLASS: my-article
#+DATE: <2020-07-26 Sun 18:45>
#+TITLE:  时间志

* 时间志
  #+BEGIN: clocktable :scope subtree :block untilnow
  #+CAPTION: Clock summary at [2022-01-22 Sat 02:28], for now.
  | Headline          | Time      |         |
  |-------------------+-----------+---------|
  | *Total time*      | *4d 7:51* |         |
  |-------------------+-----------+---------|
  | 时间志            | 4d 7:51   |         |
  | \_  Flask         |           |    0:25 |
  | \_  方法论        |           |   11:49 |
  | \_  JavaScript    |           |    5:38 |
  | \_  工作          |           | 2d 9:29 |
  | \_  Python        |           |    5:20 |
  | \_  Bilibili 视频 |           |   16:48 |
  | \_  超市          |           |    1:12 |
  | \_  洗漱用餐午睡  |           |    4:15 |
  | \_  跑步锻炼      |           |    0:55 |
  #+END

** TODO Flask
   :LOGBOOK:
   CLOCK: [2020-07-26 Sun 18:45]--[2020-07-26 Sun 19:10] =>  0:25
   :END:
** NEXT 方法论
   :PROPERTIES:
   :Effort:   60
   :END:
   :LOGBOOK:
   CLOCK: [2021-07-20 Tue 19:39]--[2021-07-20 Tue 21:17] =>  1:38
   CLOCK: [2021-07-20 Tue 18:58]--[2021-07-20 Tue 19:39] =>  0:41
   CLOCK: [2021-07-04 Sun 12:46]--[2021-07-04 Sun 13:08] =>  0:22
   CLOCK: [2021-07-04 Sun 12:36]--[2021-07-04 Sun 12:46] =>  0:10
   CLOCK: [2020-09-07 Mon 22:08]--[2020-09-07 Mon 23:15] =>  1:07
   CLOCK: [2020-09-07 Mon 19:42]--[2020-09-07 Mon 20:08] =>  0:26
   CLOCK: [2020-09-07 Mon 16:00]--[2020-09-07 Mon 16:25] =>  0:25
   CLOCK: [2020-09-07 Mon 13:35]--[2020-09-07 Mon 13:58] =>  0:23
   CLOCK: [2020-09-07 Mon 11:55]--[2020-09-07 Mon 12:53] =>  0:58
   CLOCK: [2020-09-06 Sun 21:20]--[2020-09-06 Sun 22:00] =>  0:40
   CLOCK: [2020-09-06 Sun 19:57]--[2020-09-06 Sun 20:34] =>  0:37
   CLOCK: [2020-09-06 Sun 17:18]--[2020-09-06 Sun 17:30] =>  0:12
   CLOCK: [2020-09-06 Sun 15:26]--[2020-09-06 Sun 16:05] =>  0:39
   CLOCK: [2020-09-05 Sat 19:06]--[2020-09-05 Sat 19:59] =>  0:53
   CLOCK: [2020-09-05 Sat 14:16]--[2020-09-05 Sat 14:54] =>  0:38
   CLOCK: [2020-09-05 Sat 13:26]--[2020-09-05 Sat 13:27] =>  0:01
   CLOCK: [2020-09-05 Sat 12:17]--[2020-09-05 Sat 13:26] =>  1:09
   CLOCK: [2020-08-05 Wed 00:47]--[2020-08-05 Wed 01:12] =>  0:25
   CLOCK: [2020-08-01 Sat 12:07]--[2020-08-01 Sat 12:32] =>  0:25
   :END:
** NEXT JavaScript
   :LOGBOOK:
   CLOCK: [2021-07-26 Mon 17:29]--[2021-07-26 Mon 17:59] =>  0:30
   CLOCK: [2021-07-26 Mon 16:20]--[2021-07-26 Mon 17:14] =>  0:54
   CLOCK: [2021-07-26 Mon 15:08]--[2021-07-26 Mon 16:01] =>  0:53
   CLOCK: [2021-07-26 Mon 13:50]--[2021-07-26 Mon 14:53] =>  1:03
   CLOCK: [2021-07-26 Mon 13:14]--[2021-07-26 Mon 13:42] =>  0:28
   CLOCK: [2020-08-20 Thu 20:23]--[2020-08-20 Thu 21:23] =>  1:00
   CLOCK: [2020-08-01 Sat 13:09]--[2020-08-01 Sat 13:34] =>  0:25
   CLOCK: [2020-08-01 Sat 13:09]--[2020-08-01 Sat 13:34] =>  0:25
   :END:

** NEXT 工作
   :LOGBOOK:
   CLOCK: [2021-07-26 Mon 18:00]--[2021-07-26 Mon 19:22] =>  1:22
   CLOCK: [2021-07-25 Sun 19:09]--[2021-07-25 Sun 20:23] =>  1:14
   CLOCK: [2021-07-25 Sun 18:13]--[2021-07-25 Sun 18:40] =>  0:27
   CLOCK: [2021-07-25 Sun 16:04]--[2021-07-25 Sun 17:09] =>  1:05
   CLOCK: [2021-07-25 Sun 14:32]--[2021-07-25 Sun 15:23] =>  0:51
   CLOCK: [2021-07-25 Sun 11:25]--[2021-07-25 Sun 12:08] =>  0:43
   CLOCK: [2021-07-24 Sat 22:31]--[2021-07-24 Sat 23:35] =>  1:04
   CLOCK: [2021-07-24 Sat 19:49]--[2021-07-24 Sat 21:29] =>  1:40
   CLOCK: [2021-07-24 Sat 19:06]--[2021-07-24 Sat 19:49] =>  0:43
   CLOCK: [2021-07-24 Sat 17:34]--[2021-07-24 Sat 18:42] =>  1:08
   CLOCK: [2021-07-24 Sat 16:14]--[2021-07-24 Sat 17:13] =>  0:59
   CLOCK: [2021-07-24 Sat 13:57]--[2021-07-24 Sat 15:25] =>  1:28
   CLOCK: [2021-07-24 Sat 11:17]--[2021-07-24 Sat 12:19] =>  1:02
   CLOCK: [2021-07-23 Fri 23:32]--[2021-07-23 Fri 23:41] =>  0:09
   CLOCK: [2021-07-23 Fri 21:18]--[2021-07-23 Fri 22:51] =>  1:33
   CLOCK: [2021-07-23 Fri 19:54]--[2021-07-23 Fri 20:53] =>  0:59
   CLOCK: [2021-07-23 Fri 15:22]--[2021-07-23 Fri 16:03] =>  0:41
   CLOCK: [2021-07-23 Fri 15:13]--[2021-07-23 Fri 15:22] =>  0:09
   CLOCK: [2021-07-23 Fri 14:25]--[2021-07-23 Fri 15:03] =>  0:38
   CLOCK: [2021-07-23 Fri 12:52]--[2021-07-23 Fri 13:48] =>  0:56
   CLOCK: [2021-07-23 Fri 12:14]--[2021-07-23 Fri 12:36] =>  0:22
   CLOCK: [2021-07-22 Thu 21:13]--[2021-07-22 Thu 22:01] =>  0:48
   CLOCK: [2021-07-22 Thu 19:28]--[2021-07-22 Thu 20:23] =>  0:55
   CLOCK: [2021-07-22 Thu 18:16]--[2021-07-22 Thu 18:53] =>  0:37
   CLOCK: [2021-07-22 Thu 17:35]--[2021-07-22 Thu 18:09] =>  0:34
   CLOCK: [2021-07-22 Thu 15:42]--[2021-07-22 Thu 16:22] =>  0:40
   CLOCK: [2021-07-22 Thu 14:06]--[2021-07-22 Thu 15:02] =>  0:56
   CLOCK: [2021-07-22 Thu 11:42]--[2021-07-22 Thu 12:29] =>  0:47
   CLOCK: [2021-07-20 Tue 22:16]--[2021-07-20 Tue 22:49] =>  0:33
   CLOCK: [2021-07-20 Tue 21:17]--[2021-07-20 Tue 21:58] =>  0:41
   CLOCK: [2021-07-20 Tue 17:19]--[2021-07-20 Tue 17:41] =>  0:22
   CLOCK: [2021-07-20 Tue 15:51]--[2021-07-20 Tue 16:46] =>  0:55
   CLOCK: [2021-07-20 Tue 14:30]--[2021-07-20 Tue 15:17] =>  0:47
   CLOCK: [2021-07-20 Tue 13:12]--[2021-07-20 Tue 14:17] =>  1:05
   CLOCK: [2021-07-19 Mon 21:45]--[2021-07-19 Mon 23:25] =>  1:40
   CLOCK: [2021-07-19 Mon 18:39]--[2021-07-19 Mon 20:12] =>  1:33
   CLOCK: [2021-07-19 Mon 15:07]--[2021-07-19 Mon 16:13] =>  1:06
   CLOCK: [2021-07-19 Mon 13:44]--[2021-07-19 Mon 15:07] =>  1:23
   CLOCK: [2021-07-19 Mon 12:45]--[2021-07-19 Mon 13:32] =>  0:47
   CLOCK: [2021-07-04 Sun 22:25]--[2021-07-05 Mon 00:21] =>  1:56
   CLOCK: [2021-07-04 Sun 21:19]--[2021-07-04 Sun 22:14] =>  0:55
   CLOCK: [2021-07-04 Sun 20:25]--[2021-07-04 Sun 21:05] =>  0:40
   CLOCK: [2021-07-04 Sun 19:18]--[2021-07-04 Sun 20:06] =>  0:48
   CLOCK: [2021-07-04 Sun 17:48]--[2021-07-04 Sun 18:32] =>  0:44
   CLOCK: [2021-07-04 Sun 17:13]--[2021-07-04 Sun 17:37] =>  0:24
   CLOCK: [2021-07-04 Sun 14:55]--[2021-07-04 Sun 16:35] =>  1:40
   CLOCK: [2021-07-04 Sun 13:24]--[2021-07-04 Sun 14:32] =>  1:08
   CLOCK: [2021-07-04 Sun 13:09]--[2021-07-04 Sun 13:24] =>  0:15
   CLOCK: [2021-07-03 Sat 23:30]--[2021-07-04 Sun 00:15] =>  0:45
   CLOCK: [2021-07-03 Sat 20:42]--[2021-07-03 Sat 21:27] =>  0:45
   CLOCK: [2021-07-03 Sat 18:53]--[2021-07-03 Sat 19:38] =>  0:45
   CLOCK: [2021-07-03 Sat 17:55]--[2021-07-03 Sat 18:40] =>  0:45
   CLOCK: [2021-07-03 Sat 17:13]--[2021-07-03 Sat 17:38] =>  0:25
   CLOCK: [2020-09-21 Mon 17:05]--[2020-09-21 Mon 17:41] =>  0:36
   CLOCK: [2020-09-01 Tue 18:40]--[2020-09-01 Tue 19:40] =>  1:00
   CLOCK: [2020-08-23 Sun 16:05]--[2020-08-23 Sun 16:30] =>  0:25
   CLOCK: [2020-08-23 Sun 15:38]--[2020-08-23 Sun 16:03] =>  0:25
   CLOCK: [2020-08-18 Tue 19:07]--[2020-08-18 Tue 20:07] =>  1:00
   CLOCK: [2020-08-18 Tue 15:59]--[2020-08-18 Tue 16:15] =>  0:16
   CLOCK: [2020-08-15 Sat 12:48]--[2020-08-15 Sat 13:13] =>  0:25
   CLOCK: [2020-08-15 Sat 12:09]--[2020-08-15 Sat 12:34] =>  0:25
   CLOCK: [2020-08-14 Fri 22:47]--[2020-08-14 Fri 23:47] =>  1:00
   CLOCK: [2020-08-14 Fri 21:34]--[2020-08-14 Fri 22:34] =>  1:00
   CLOCK: [2020-08-14 Fri 20:00]--[2020-08-14 Fri 21:00] =>  1:00
   CLOCK: [2020-08-11 Tue 14:25]--[2020-08-11 Tue 15:25] =>  1:00
   CLOCK: [2020-08-08 Sat 15:47]--[2020-08-08 Sat 16:27] =>  0:40
   CLOCK: [2020-08-08 Sat 14:36]--[2020-08-08 Sat 15:36] =>  1:00
   :END:
** NEXT Python
   :LOGBOOK:
   CLOCK: [2020-08-23 Sun 13:44]--[2020-08-23 Sun 14:09] =>  0:25
   CLOCK: [2020-08-21 Fri 09:24]--[2020-08-21 Fri 10:24] =>  1:00
   CLOCK: [2020-08-20 Thu 23:41]--[2020-08-21 Fri 00:41] =>  1:00
   CLOCK: [2020-08-20 Thu 21:50]--[2020-08-20 Thu 22:50] =>  1:00
   CLOCK: [2020-08-19 Wed 16:45]--[2020-08-19 Wed 17:45] =>  1:00
   CLOCK: [2020-08-19 Wed 14:20]--[2020-08-19 Wed 15:15] =>  0:55
   :END:
** NEXT Bilibili 视频
   :LOGBOOK:
   CLOCK: [2020-09-07 Mon 23:15]--[2020-09-07 Mon 23:51] =>  0:36
   CLOCK: [2020-09-07 Mon 20:10]--[2020-09-07 Mon 22:00] =>  1:50
   CLOCK: [2020-09-07 Mon 16:30]--[2020-09-07 Mon 19:42] =>  3:12
   CLOCK: [2020-09-07 Mon 13:17]--[2020-09-07 Mon 13:35] =>  0:18
   CLOCK: [2020-09-07 Mon 11:15]--[2020-09-07 Mon 11:55] =>  0:40
   CLOCK: [2020-09-06 Sun 22:00]--[2020-09-06 Sun 23:13] =>  1:13
   CLOCK: [2020-09-06 Sun 20:30]--[2020-09-06 Sun 21:17] =>  0:47
   CLOCK: [2020-09-06 Sun 18:56]--[2020-09-06 Sun 19:51] =>  0:55
   CLOCK: [2020-09-06 Sun 17:30]--[2020-09-06 Sun 18:00] =>  0:30
   CLOCK: [2020-09-06 Sun 16:07]--[2020-09-06 Sun 17:03] =>  0:56
   CLOCK: [2020-09-05 Sat 21:53]--[2020-09-06 Sun 01:20] =>  3:27
   CLOCK: [2020-09-05 Sat 14:55]--[2020-09-05 Sat 16:18] =>  1:23
   CLOCK: [2020-09-05 Sat 13:27]--[2020-09-05 Sat 14:12] =>  0:45
   CLOCK: [2020-09-04 Fri 20:21]--[2020-09-04 Fri 20:37] =>  0:16
   :END:
** NEXT 超市
 :LOGBOOK:
 CLOCK: [2020-09-05 Sat 20:39]--[2020-09-05 Sat 21:51] =>  1:12
 :END:
** NEXT 洗漱用餐午睡
   :LOGBOOK:
   CLOCK: [2020-09-07 Mon 14:00]--[2020-09-07 Mon 15:52] =>  1:52
   CLOCK: [2020-09-07 Mon 12:54]--[2020-09-07 Mon 13:11] =>  0:17
   CLOCK: [2020-09-06 Sun 18:00]--[2020-09-06 Sun 18:56] =>  0:56
   CLOCK: [2020-09-06 Sun 14:12]--[2020-09-06 Sun 15:22] =>  1:10
   :END:

** NEXT 跑步锻炼
   :LOGBOOK:
   CLOCK: [2021-07-03 Sat 19:40]--[2021-07-03 Sat 20:35] =>  0:55
   :END:

** TODO [#C]P8
  https://www.bilibili.com/video/BV1ys411472E?p=8&spm_id_from=pageDriver

  [2021-08-18 Wed 17:12]

* NEXT 数学
  :LOGBOOK:
  CLOCK: [2021-09-27 Mon 13:00]--[2021-09-27 Mon 17:49] =>  4:49
  CLOCK: [2021-09-25 Sat 14:10]--[2021-09-25 Sat 15:01] =>  0:51
  CLOCK: [2021-09-25 Sat 10:17]--[2021-09-25 Sat 12:49] =>  2:32
  CLOCK: [2021-09-20 Mon 11:21]--[2021-09-20 Mon 12:50] =>  1:29
  CLOCK: [2021-09-14 Tue 13:57]--[2021-09-14 Tue 14:33] =>  0:36
  CLOCK: [2021-09-14 Tue 12:05]--[2021-09-14 Tue 13:34] =>  1:29
  CLOCK: [2021-09-10 Fri 17:41]--[2021-09-10 Fri 20:45] =>  3:04
  CLOCK: [2021-09-10 Fri 15:18]--[2021-09-10 Fri 16:19] =>  1:01
  CLOCK: [2021-09-10 Fri 11:51]--[2021-09-10 Fri 13:19] =>  1:28
  CLOCK: [2021-09-10 Fri 10:27]--[2021-09-10 Fri 10:32] =>  0:05
  CLOCK: [2021-09-09 Thu 15:07]--[2021-09-09 Thu 21:58] =>  6:51
  CLOCK: [2021-09-09 Thu 13:29]--[2021-09-09 Thu 14:19] =>  0:50
  CLOCK: [2021-09-09 Thu 10:29]--[2021-09-09 Thu 13:04] =>  2:35
  CLOCK: [2021-09-08 Wed 22:22]--[2021-09-08 Wed 23:34] =>  1:12
  CLOCK: [2021-09-08 Wed 20:20]--[2021-09-08 Wed 22:09] =>  1:49
  CLOCK: [2021-09-05 Sun 15:59]--[2021-09-05 Sun 16:56] =>  0:57
  CLOCK: [2021-09-05 Sun 13:09]--[2021-09-05 Sun 15:50] =>  2:41
  CLOCK: [2021-09-04 Sat 16:35]--[2021-09-04 Sat 18:17] =>  1:42
  CLOCK: [2021-09-04 Sat 14:50]--[2021-09-04 Sat 16:04] =>  1:14
  CLOCK: [2021-09-04 Sat 13:35]--[2021-09-04 Sat 14:00] =>  0:25
  CLOCK: [2021-09-04 Sat 10:05]--[2021-09-04 Sat 12:46] =>  2:41
  CLOCK: [2021-09-03 Fri 21:37]--[2021-09-04 Sat 00:14] =>  2:37
  CLOCK: [2021-09-03 Fri 19:04]--[2021-09-03 Fri 20:18] =>  1:14
  CLOCK: [2021-09-03 Fri 13:36]--[2021-09-03 Fri 17:03] =>  3:27
  CLOCK: [2021-09-02 Thu 14:29]--[2021-09-02 Thu 18:59] =>  4:30
  CLOCK: [2021-09-01 Wed 21:29]--[2021-09-01 Wed 22:42] =>  1:13
  CLOCK: [2021-08-30 Mon 19:13]--[2021-08-30 Mon 19:57] =>  0:44
  CLOCK: [2021-08-30 Mon 14:34]--[2021-08-30 Mon 16:42] =>  2:08
  CLOCK: [2021-08-30 Mon 12:02]--[2021-08-30 Mon 13:01] =>  0:59
  CLOCK: [2021-08-30 Mon 11:37]--[2021-08-30 Mon 11:49] =>  0:12
  CLOCK: [2021-08-30 Mon 10:03]--[2021-08-30 Mon 11:01] =>  0:58
  CLOCK: [2021-08-29 Sun 14:35]--[2021-08-29 Sun 16:35] =>  2:00
  CLOCK: [2021-08-29 Sun 12:00]--[2021-08-29 Sun 14:24] =>  2:24
  CLOCK: [2021-08-29 Sun 10:10]--[2021-08-29 Sun 11:33] =>  1:23
  CLOCK: [2021-08-28 Sat 18:17]--[2021-08-28 Sat 19:16] =>  0:59
  CLOCK: [2021-08-28 Sat 15:39]--[2021-08-28 Sat 16:32] =>  0:53
  CLOCK: [2021-08-28 Sat 12:51]--[2021-08-28 Sat 14:51] =>  2:00
  CLOCK: [2021-08-27 Fri 22:46]--[2021-08-28 Sat 00:11] =>  1:25
  CLOCK: [2021-08-27 Fri 19:52]--[2021-08-27 Fri 22:01] =>  2:09
  CLOCK: [2021-08-27 Fri 17:48]--[2021-08-27 Fri 19:10] =>  1:22
  CLOCK: [2021-08-27 Fri 16:38]--[2021-08-27 Fri 17:27] =>  0:49
  CLOCK: [2021-08-27 Fri 13:47]--[2021-08-27 Fri 16:07] =>  2:20
  CLOCK: [2021-08-27 Fri 11:17]--[2021-08-27 Fri 12:34] =>  1:17
  CLOCK: [2021-08-26 Thu 18:17]--[2021-08-26 Thu 19:54] =>  1:37
  CLOCK: [2021-08-26 Thu 14:59]--[2021-08-26 Thu 16:53] =>  1:54
  CLOCK: [2021-08-26 Thu 12:41]--[2021-08-26 Thu 14:37] =>  1:56
  CLOCK: [2021-08-25 Wed 20:58]--[2021-08-25 Wed 21:56] =>  0:58
  CLOCK: [2021-08-25 Wed 19:51]--[2021-08-25 Wed 20:39] =>  0:48
  CLOCK: [2021-08-25 Wed 19:01]--[2021-08-25 Wed 19:39] =>  0:38
  CLOCK: [2021-08-25 Wed 16:40]--[2021-08-25 Wed 17:34] =>  0:54
  CLOCK: [2021-08-25 Wed 15:07]--[2021-08-25 Wed 16:00] =>  0:53
  CLOCK: [2021-08-25 Wed 13:43]--[2021-08-25 Wed 14:28] =>  0:45
  CLOCK: [2021-08-25 Wed 11:53]--[2021-08-25 Wed 13:28] =>  1:35
  CLOCK: [2021-08-24 Tue 14:56]--[2021-08-24 Tue 15:47] =>  0:51
  CLOCK: [2021-08-23 Mon 15:28]--[2021-08-23 Mon 16:01] =>  0:33
  CLOCK: [2021-08-23 Mon 13:59]--[2021-08-23 Mon 14:59] =>  1:00
  CLOCK: [2021-08-23 Mon 12:59]--[2021-08-23 Mon 13:10] =>  0:11
  CLOCK: [2021-08-22 Sun 15:08]--[2021-08-22 Sun 16:54] =>  1:46
  CLOCK: [2021-08-22 Sun 12:57]--[2021-08-22 Sun 13:55] =>  0:58
  CLOCK: [2021-08-22 Sun 09:57]--[2021-08-22 Sun 11:33] =>  1:36
  CLOCK: [2021-08-22 Sun 08:17]--[2021-08-22 Sun 09:47] =>  1:30
  CLOCK: [2021-08-21 Sat 13:53]--[2021-08-21 Sat 15:18] =>  1:25
  CLOCK: [2021-08-21 Sat 12:06]--[2021-08-21 Sat 13:32] =>  1:26
  CLOCK: [2021-08-20 Fri 23:13]--[2021-08-21 Sat 01:23] =>  2:10
  CLOCK: [2021-08-20 Fri 18:53]--[2021-08-20 Fri 22:27] =>  3:34
  CLOCK: [2021-08-20 Fri 17:27]--[2021-08-20 Fri 17:52] =>  0:25
  CLOCK: [2021-08-20 Fri 13:22]--[2021-08-20 Fri 15:26] =>  2:04
  CLOCK: [2021-08-19 Thu 15:11]--[2021-08-19 Thu 16:39] =>  1:28
  CLOCK: [2021-08-19 Thu 13:13]--[2021-08-19 Thu 14:36] =>  1:23
  CLOCK: [2021-08-18 Wed 23:53]--[2021-08-19 Thu 01:26] =>  1:33
  CLOCK: [2021-08-18 Wed 16:37]--[2021-08-18 Wed 17:08] =>  0:31
  CLOCK: [2021-08-18 Wed 15:12]--[2021-08-18 Wed 15:55] =>  0:43
  CLOCK: [2021-08-18 Wed 13:34]--[2021-08-18 Wed 15:00] =>  1:26
  CLOCK: [2021-08-18 Wed 10:09]--[2021-08-18 Wed 10:55] =>  0:46
  CLOCK: [2021-08-17 Tue 17:17]--[2021-08-17 Tue 18:15] =>  0:58
  CLOCK: [2021-08-17 Tue 16:26]--[2021-08-17 Tue 17:02] =>  0:36
  CLOCK: [2021-08-17 Tue 14:30]--[2021-08-17 Tue 16:05] =>  1:35
  CLOCK: [2021-08-17 Tue 13:08]--[2021-08-17 Tue 13:52] =>  0:44
  CLOCK: [2021-08-16 Mon 23:13]--[2021-08-17 Tue 01:48] =>  2:35
  CLOCK: [2021-08-16 Mon 21:24]--[2021-08-16 Mon 22:42] =>  1:18
  CLOCK: [2021-08-16 Mon 19:06]--[2021-08-16 Mon 20:55] =>  1:49
  CLOCK: [2021-08-15 Sun 13:27]--[2021-08-15 Sun 14:25] =>  0:58
  CLOCK: [2021-08-15 Sun 11:40]--[2021-08-15 Sun 12:43] =>  1:03
  CLOCK: [2021-08-14 Sat 20:49]--[2021-08-15 Sun 00:03] =>  3:14
  CLOCK: [2021-08-13 Fri 21:40]--[2021-08-13 Fri 23:47] =>  2:07
  CLOCK: [2021-08-13 Fri 18:46]--[2021-08-13 Fri 20:49] =>  2:03
  CLOCK: [2021-08-13 Fri 16:58]--[2021-08-13 Fri 17:57] =>  0:59
  CLOCK: [2021-08-13 Fri 15:03]--[2021-08-13 Fri 16:20] =>  1:17
  CLOCK: [2021-08-13 Fri 14:00]--[2021-08-13 Fri 14:55] =>  0:55
  CLOCK: [2021-08-13 Fri 12:22]--[2021-08-13 Fri 13:20] =>  0:58
  CLOCK: [2021-08-12 Thu 21:12]--[2021-08-12 Thu 22:48] =>  1:36
  CLOCK: [2021-08-12 Thu 18:12]--[2021-08-12 Thu 20:29] =>  2:17
  CLOCK: [2021-08-12 Thu 15:43]--[2021-08-12 Thu 16:12] =>  0:29
  CLOCK: [2021-08-12 Thu 14:28]--[2021-08-12 Thu 15:19] =>  0:51
  CLOCK: [2021-08-12 Thu 13:07]--[2021-08-12 Thu 13:55] =>  0:48
  CLOCK: [2021-08-12 Thu 11:02]--[2021-08-12 Thu 12:28] =>  1:26
  CLOCK: [2021-08-11 Wed 15:32]--[2021-08-11 Wed 17:25] =>  1:53
  CLOCK: [2021-08-11 Wed 13:36]--[2021-08-11 Wed 15:10] =>  1:34
  CLOCK: [2021-08-11 Wed 11:53]--[2021-08-11 Wed 12:56] =>  1:03
  CLOCK: [2021-08-11 Wed 10:04]--[2021-08-11 Wed 11:24] =>  1:20
  CLOCK: [2021-08-10 Tue 21:12]--[2021-08-10 Tue 21:57] =>  0:45
  CLOCK: [2021-08-10 Tue 19:04]--[2021-08-10 Tue 20:36] =>  1:32
  CLOCK: [2021-08-10 Tue 18:02]--[2021-08-10 Tue 18:21] =>  0:19
  CLOCK: [2021-08-10 Tue 14:25]--[2021-08-10 Tue 16:37] =>  2:12
  CLOCK: [2021-08-10 Tue 11:33]--[2021-08-10 Tue 13:58] =>  2:25
  CLOCK: [2021-08-09 Mon 18:17]--[2021-08-09 Mon 19:02] =>  0:45
  CLOCK: [2021-08-09 Mon 14:17]--[2021-08-09 Mon 16:03] =>  1:46
  CLOCK: [2021-08-09 Mon 13:05]--[2021-08-09 Mon 14:11] =>  1:06
  CLOCK: [2021-08-09 Mon 11:55]--[2021-08-09 Mon 12:54] =>  0:59
  CLOCK: [2021-08-08 Sun 21:11]--[2021-08-08 Sun 22:13] =>  1:02
  CLOCK: [2021-08-08 Sun 19:45]--[2021-08-08 Sun 20:32] =>  0:47
  CLOCK: [2021-08-08 Sun 18:30]--[2021-08-08 Sun 19:04] =>  0:34
  CLOCK: [2021-08-08 Sun 15:04]--[2021-08-08 Sun 15:58] =>  0:54
  CLOCK: [2021-08-08 Sun 13:38]--[2021-08-08 Sun 14:51] =>  1:13
  CLOCK: [2021-08-08 Sun 10:35]--[2021-08-08 Sun 12:25] =>  1:50
  CLOCK: [2021-08-07 Sat 21:10]--[2021-08-07 Sat 21:45] =>  0:35
  CLOCK: [2021-08-07 Sat 18:31]--[2021-08-07 Sat 20:50] =>  2:19
  CLOCK: [2021-08-06 Fri 17:21]--[2021-08-06 Fri 18:45] =>  1:24
  CLOCK: [2021-08-06 Fri 16:22]--[2021-08-06 Fri 16:44] =>  0:22
  CLOCK: [2021-08-06 Fri 15:28]--[2021-08-06 Fri 16:09] =>  0:41
  CLOCK: [2021-08-06 Fri 13:34]--[2021-08-06 Fri 15:13] =>  1:39
  CLOCK: [2021-08-06 Fri 12:07]--[2021-08-06 Fri 13:20] =>  1:13
  CLOCK: [2021-08-06 Fri 05:24]--[2021-08-06 Fri 05:33] =>  0:09
  CLOCK: [2021-08-05 Thu 23:01]--[2021-08-05 Thu 23:54] =>  0:53
  CLOCK: [2021-08-05 Thu 20:53]--[2021-08-05 Thu 22:40] =>  1:47
  CLOCK: [2021-08-05 Thu 18:54]--[2021-08-05 Thu 20:25] =>  1:31
  CLOCK: [2021-08-05 Thu 17:38]--[2021-08-05 Thu 18:18] =>  0:40
  CLOCK: [2021-08-05 Thu 13:36]--[2021-08-05 Thu 16:36] =>  3:00
  CLOCK: [2021-08-05 Thu 12:17]--[2021-08-05 Thu 12:48] =>  0:31
  CLOCK: [2021-08-05 Thu 10:37]--[2021-08-05 Thu 12:08] =>  1:31
  CLOCK: [2021-08-04 Wed 22:49]--[2021-08-05 Thu 02:03] =>  3:14
  CLOCK: [2021-08-04 Wed 21:27]--[2021-08-04 Wed 22:40] =>  1:13
  CLOCK: [2021-08-04 Wed 19:26]--[2021-08-04 Wed 21:11] =>  1:45
  CLOCK: [2021-08-04 Wed 16:46]--[2021-08-04 Wed 18:45] =>  1:59
  CLOCK: [2021-08-04 Wed 15:13]--[2021-08-04 Wed 16:32] =>  1:19
  CLOCK: [2021-08-04 Wed 13:54]--[2021-08-04 Wed 15:06] =>  1:12
  CLOCK: [2021-08-04 Wed 12:46]--[2021-08-04 Wed 13:15] =>  0:29
  CLOCK: [2021-08-04 Wed 11:30]--[2021-08-04 Wed 12:16] =>  0:46
  CLOCK: [2021-08-04 Wed 10:26]--[2021-08-04 Wed 11:25] =>  0:59
  CLOCK: [2021-08-04 Wed 08:24]--[2021-08-04 Wed 10:12] =>  1:48
  CLOCK: [2021-08-03 Tue 20:34]--[2021-08-03 Tue 22:18] =>  1:44
  CLOCK: [2021-08-03 Tue 17:33]--[2021-08-03 Tue 20:09] =>  2:36
  CLOCK: [2021-08-03 Tue 14:07]--[2021-08-03 Tue 15:47] =>  1:40
  CLOCK: [2021-08-03 Tue 12:48]--[2021-08-03 Tue 13:24] =>  0:36
  CLOCK: [2021-08-03 Tue 10:51]--[2021-08-03 Tue 12:16] =>  1:25
  CLOCK: [2021-08-03 Tue 08:57]--[2021-08-03 Tue 10:18] =>  1:21
  CLOCK: [2021-08-02 Mon 21:19]--[2021-08-02 Mon 23:03] =>  1:44
  CLOCK: [2021-08-02 Mon 18:20]--[2021-08-02 Mon 20:44] =>  2:24
  CLOCK: [2021-08-02 Mon 16:09]--[2021-08-02 Mon 16:45] =>  0:36
  CLOCK: [2021-08-02 Mon 14:03]--[2021-08-02 Mon 15:46] =>  1:43
  CLOCK: [2021-08-02 Mon 12:36]--[2021-08-02 Mon 13:16] =>  0:40
  CLOCK: [2021-08-02 Mon 11:01]--[2021-08-02 Mon 11:48] =>  0:47
  CLOCK: [2021-08-01 Sun 20:47]--[2021-08-01 Sun 21:36] =>  0:49
  CLOCK: [2021-08-01 Sun 18:56]--[2021-08-01 Sun 20:20] =>  1:24
  CLOCK: [2021-08-01 Sun 15:42]--[2021-08-01 Sun 17:16] =>  1:34
  CLOCK: [2021-08-01 Sun 13:01]--[2021-08-01 Sun 15:33] =>  2:32
  CLOCK: [2021-08-01 Sun 00:33]--[2021-08-01 Sun 01:35] =>  1:02
  CLOCK: [2021-07-31 Sat 22:59]--[2021-08-01 Sun 00:09] =>  1:10
  CLOCK: [2021-07-31 Sat 19:35]--[2021-07-31 Sat 22:20] =>  2:45
  CLOCK: [2021-07-31 Sat 15:21]--[2021-07-31 Sat 16:47] =>  1:26
  CLOCK: [2021-07-30 Fri 22:21]--[2021-07-31 Sat 00:15] =>  1:54
  CLOCK: [2021-07-30 Fri 21:48]--[2021-07-30 Fri 22:01] =>  0:13
  CLOCK: [2021-07-30 Fri 20:30]--[2021-07-30 Fri 21:01] =>  0:31
  CLOCK: [2021-07-30 Fri 15:20]--[2021-07-30 Fri 20:25] =>  5:05
  CLOCK: [2021-07-30 Fri 13:20]--[2021-07-30 Fri 14:56] =>  1:36
  CLOCK: [2021-07-29 Thu 13:02]--[2021-07-29 Thu 14:07] =>  1:05
  CLOCK: [2021-07-29 Thu 10:12]--[2021-07-29 Thu 11:26] =>  1:14
  CLOCK: [2021-07-28 Wed 22:35]--[2021-07-28 Wed 23:18] =>  0:43
  CLOCK: [2021-07-28 Wed 20:40]--[2021-07-28 Wed 22:06] =>  1:26
  :END:

* NEXT 政治
  :LOGBOOK:
  CLOCK: [2021-09-19 Sun 18:29]--[2021-09-19 Sun 19:33] =>  1:04
  :END:

* NEXT 理论力学
  :LOGBOOK:
  CLOCK: [2021-10-02 Sat 12:34]--[2021-10-02 Sat 15:49] =>  3:15
  CLOCK: [2021-09-27 Mon 18:43]--[2021-09-27 Mon 20:51] =>  2:08
  CLOCK: [2021-09-27 Mon 17:50]--[2021-09-27 Mon 18:08] =>  0:18
  CLOCK: [2021-09-25 Sat 16:15]--[2021-09-25 Sat 20:46] =>  4:31
  CLOCK: [2021-09-19 Sun 19:44]--[2021-09-20 Mon 01:59] =>  6:15
  CLOCK: [2021-09-19 Sun 17:55]--[2021-09-19 Sun 18:29] =>  0:34
  CLOCK: [2021-09-19 Sun 12:00]--[2021-09-19 Sun 16:45] =>  4:45
  CLOCK: [2021-09-04 Sat 21:33]--[2021-09-04 Sat 23:06] =>  1:33
  CLOCK: [2021-09-04 Sat 18:52]--[2021-09-04 Sat 21:01] =>  2:09
  CLOCK: [2021-09-02 Thu 22:25]--[2021-09-02 Thu 23:27] =>  1:02
  CLOCK: [2021-09-02 Thu 20:53]--[2021-09-02 Thu 21:40] =>  0:47
  CLOCK: [2021-09-02 Thu 20:10]--[2021-09-02 Thu 20:42] =>  0:32
  CLOCK: [2021-09-02 Thu 19:16]--[2021-09-02 Thu 19:58] =>  0:42
  CLOCK: [2021-09-01 Wed 18:06]--[2021-09-01 Wed 19:17] =>  1:11
  CLOCK: [2021-09-01 Wed 15:39]--[2021-09-01 Wed 17:07] =>  1:28
  CLOCK: [2021-09-01 Wed 11:54]--[2021-09-01 Wed 15:17] =>  3:23
  CLOCK: [2021-08-31 Tue 15:58]--[2021-08-31 Tue 16:56] =>  0:58
  CLOCK: [2021-08-31 Tue 14:05]--[2021-08-31 Tue 14:40] =>  0:35
  CLOCK: [2021-08-31 Tue 10:52]--[2021-08-31 Tue 11:30] =>  0:38
  CLOCK: [2021-08-30 Mon 22:37]--[2021-08-31 Tue 00:00] =>  1:23
  CLOCK: [2021-08-30 Mon 21:11]--[2021-08-30 Mon 22:16] =>  1:05
  CLOCK: [2021-08-30 Mon 19:58]--[2021-08-30 Mon 20:10] =>  0:12
  CLOCK: [2021-08-29 Sun 19:00]--[2021-08-29 Sun 20:35] =>  1:35
  CLOCK: [2021-08-29 Sun 17:31]--[2021-08-29 Sun 18:06] =>  0:35
  CLOCK: [2021-08-28 Sat 23:21]--[2021-08-29 Sun 00:03] =>  0:42
  CLOCK: [2021-08-28 Sat 21:39]--[2021-08-28 Sat 23:16] =>  1:37
  CLOCK: [2021-08-28 Sat 19:30]--[2021-08-28 Sat 20:13] =>  0:43
  CLOCK: [2021-08-22 Sun 23:13]--[2021-08-23 Mon 00:35] =>  1:22
  CLOCK: [2021-08-22 Sun 19:42]--[2021-08-22 Sun 21:48] =>  2:06
  CLOCK: [2021-08-22 Sun 17:51]--[2021-08-22 Sun 18:53] =>  1:02
  CLOCK: [2021-08-18 Wed 21:57]--[2021-08-18 Wed 23:43] =>  1:46
  CLOCK: [2021-08-18 Wed 19:35]--[2021-08-18 Wed 21:35] =>  2:00
  CLOCK: [2021-08-18 Wed 17:46]--[2021-08-18 Wed 18:51] =>  1:05
  CLOCK: [2021-08-17 Tue 21:22]--[2021-08-17 Tue 23:32] =>  2:10
  CLOCK: [2021-08-17 Tue 19:59]--[2021-08-17 Tue 21:17] =>  1:18
  CLOCK: [2021-08-16 Mon 15:31]--[2021-08-16 Mon 17:25] =>  1:54
  CLOCK: [2021-08-16 Mon 14:23]--[2021-08-16 Mon 15:15] =>  0:52
  CLOCK: [2021-08-14 Sat 19:39]--[2021-08-14 Sat 20:24] =>  0:45
  CLOCK: [2021-08-14 Sat 18:18]--[2021-08-14 Sat 18:30] =>  0:12
  CLOCK: [2021-08-14 Sat 15:39]--[2021-08-14 Sat 17:32] =>  1:53
  CLOCK: [2021-08-14 Sat 12:33]--[2021-08-14 Sat 13:53] =>  1:20
  CLOCK: [2021-08-14 Sat 10:54]--[2021-08-14 Sat 11:36] =>  0:42
  CLOCK: [2021-08-11 Wed 22:37]--[2021-08-12 Thu 00:09] =>  1:32
  CLOCK: [2021-08-11 Wed 20:18]--[2021-08-11 Wed 22:04] =>  1:46
  CLOCK: [2021-08-11 Wed 18:44]--[2021-08-11 Wed 19:50] =>  1:06
  CLOCK: [2021-08-09 Mon 19:06]--[2021-08-09 Mon 21:09] =>  2:03
  CLOCK: [2021-08-08 Sun 01:39]--[2021-08-08 Sun 01:58] =>  0:19
  CLOCK: [2021-08-07 Sat 14:02]--[2021-08-07 Sat 15:55] =>  1:53
  CLOCK: [2021-08-07 Sat 11:41]--[2021-08-07 Sat 13:24] =>  1:43
  CLOCK: [2021-08-07 Sat 09:41]--[2021-08-07 Sat 11:35] =>  1:54
  CLOCK: [2021-07-31 Sat 14:34]--[2021-07-31 Sat 15:10] =>  0:36
  CLOCK: [2021-07-31 Sat 14:28]--[2021-07-31 Sat 14:29] =>  0:01
  CLOCK: [2021-07-31 Sat 13:45]--[2021-07-31 Sat 14:16] =>  0:31
  CLOCK: [2021-07-31 Sat 12:36]--[2021-07-31 Sat 13:22] =>  0:46
  CLOCK: [2021-07-31 Sat 10:43]--[2021-07-31 Sat 12:06] =>  1:23
  CLOCK: [2021-07-29 Thu 17:49]--[2021-07-29 Thu 20:05] =>  2:16
  CLOCK: [2021-07-29 Thu 17:08]--[2021-07-29 Thu 17:40] =>  0:32
  :END:
  https://www.bilibili.com/video/BV1E441117wS?p=28
  正弦结构 摆动导杆机构 四杆机构 曲柄滑块机构 凸轮机构

* NEXT 英语
  :LOGBOOK:
  CLOCK: [2021-09-27 Mon 22:18]--[2021-09-27 Mon 23:28] =>  1:10
  CLOCK: [2021-09-25 Sat 21:55]--[2021-09-25 Sat 22:31] =>  0:36
  CLOCK: [2021-09-10 Fri 13:47]--[2021-09-10 Fri 15:05] =>  1:18
  CLOCK: [2021-08-30 Mon 08:54]--[2021-08-30 Mon 09:45] =>  0:51
  CLOCK: [2021-08-07 Sat 23:16]--[2021-08-08 Sun 00:53] =>  1:37
  :END:

* 统计
#+BEGIN: clocktable :scope file :maxlevel 2
#+CAPTION: Clock summary at [2021-08-07 Sat 01:42]
| Headline          |       Time |         |
|-------------------+------------+---------|
| *Total time*      | *7d 20:34* |         |
|-------------------+------------+---------|
| 时间志            |    7d 9:41 |         |
| \_  Flask         |            |    0:25 |
| \_  方法论        |            |   11:49 |
| \_  JavaScript    |            |    5:38 |
| \_  工作          |            | 2d 9:29 |
| \_  Python        |            |    5:20 |
| \_  Bilibili 视频 |            |   16:48 |
| \_  超市          |            |    1:12 |
| \_  洗漱用餐午睡  |            |    4:15 |
| \_  跑步锻炼      |            |    0:55 |
| \_  数学          |            | 3d 1:50 |
| 理论力学          |       6:05 |         |
| [2021-08-03 Tue]  |       2:24 |         |
| [2021-08-02 Mon]  |       2:24 |         |
#+END:

* DONE [2021-09-04 Sat]
CLOSED: [2022-01-22 Sat 02:27]
- State "DONE"       from "NEXT"       [2022-01-22 Sat 02:27]
  #+BEGIN: clocktable :scope file :block 2021-09-04
  #+CAPTION: Clock summary at [2021-09-04 Sat 23:43], for Saturday, September 04, 2021.
  | Headline     |   Time |
  |--------------+--------|
  | *Total time* | *9:58* |
  |--------------+--------|
  | 数学         |   6:16 |
  | 理论力学     |   3:42 |
  #+END

* DONE [2021-09-02 Thu]
CLOSED: [2022-01-22 Sat 02:27]
- State "DONE"       from "NEXT"       [2022-01-22 Sat 02:27]
  #+BEGIN: clocktable :scope file :block 2021-09-02
  #+CAPTION: Clock summary at [2021-09-02 Thu 23:28], for Thursday, September 02, 2021.
  | Headline     |   Time |
  |--------------+--------|
  | *Total time* | *7:33* |
  |--------------+--------|
  | 数学         |   4:30 |
  | 理论力学     |   3:03 |
  #+END

* DONE [2021-08-30 Wed]
CLOSED: [2022-01-22 Sat 02:27]
  #+BEGIN: clocktable :scope file :block 2021-08-30
  #+CAPTION: Clock summary at [2021-08-31 Tue 00:00], for Monday, August 30, 2021.
  | Headline     |   Time |
  |--------------+--------|
  | *Total time* | *8:32* |
  |--------------+--------|
  | 数学         |   5:01 |
  | 理论力学     |   2:40 |
  | 英语         |   0:51 |
  #+END

* DONE [2021-08-29 Wed]
CLOSED: [2022-01-22 Sat 02:27]
  #+BEGIN: clocktable :scope file :block 2021-08-29
  #+CAPTION: Clock summary at [2021-08-29 Sun 23:26], for Sunday, August 29, 2021.
  | Headline     |   Time |
  |--------------+--------|
  | *Total time* | *8:00* |
  |--------------+--------|
  | 数学         |   5:47 |
  | 理论力学     |   2:13 |
  #+END

* DONE [2021-08-28 Wed]
CLOSED: [2022-01-22 Sat 02:27]
  #+BEGIN: clocktable :scope file :block 2021-08-28
  #+CAPTION: Clock summary at [2021-08-29 Sun 00:03], for Saturday, August 28, 2021.
  | Headline     |   Time |
  |--------------+--------|
  | *Total time* | *7:02* |
  |--------------+--------|
  | 数学         |   4:03 |
  | 理论力学     |   2:59 |
  #+END

* DONE [2021-08-27 Wed]
CLOSED: [2022-01-22 Sat 02:27]
  #+BEGIN: clocktable :scope file :block 2021-08-27
  #+CAPTION: Clock summary at [2021-08-28 Sat 00:11], for Friday, August 27, 2021.
  | Headline     | Time   |
  |--------------+--------|
  | *Total time* | *9:11* |
  |--------------+--------|
  | 数学         | 9:11   |
  #+END

* DONE [2021-08-25 Wed]
CLOSED: [2022-01-22 Sat 02:27]
  #+BEGIN: clocktable :scope file :block 2021-08-25
  #+CAPTION: Clock summary at [2021-08-25 Wed 21:57], for Wednesday, August 25, 2021.
  | Headline     | Time   |
  |--------------+--------|
  | *Total time* | *6:31* |
  |--------------+--------|
  | 数学         | 6:31   |
  #+END

* DONE [2021-08-22 Sun]
CLOSED: [2022-01-22 Sat 02:27]
  #+BEGIN: clocktable :scope file :block 2021-08-22
  #+CAPTION: Clock summary at [2021-08-23 Mon 00:36], for Sunday, August 22, 2021.
  | Headline     |   Time |
  |--------------+--------|
  | *Total time* | *9:45* |
  |--------------+--------|
  | 数学         |   5:50 |
  | 理论力学     |   3:55 |
  #+END

* DONE [2021-08-16 Fri]
CLOSED: [2022-01-22 Sat 02:27]
  #+BEGIN: clocktable :scope file :block 2021-08-16
  #+CAPTION: Clock summary at [2021-08-17 Tue 01:48], for Monday, August 16, 2021.
  | Headline     |   Time |
  |--------------+--------|
  | *Total time* | *6:40* |
  |--------------+--------|
  | 数学         |   3:54 |
  | 理论力学     |   2:46 |
  #+END

* DONE [2021-08-14 Fri]
CLOSED: [2022-01-22 Sat 02:27]
  #+BEGIN: clocktable :scope file :block 2021-08-14
  #+CAPTION: Clock summary at [2021-08-15 Sun 00:03], for Saturday, August 14, 2021.
  | Headline     |   Time |
  |--------------+--------|
  | *Total time* | *8:03* |
  |--------------+--------|
  | 数学         |   3:11 |
  | 理论力学     |   4:52 |
  #+END

* DONE [2021-08-13 Fri]
CLOSED: [2022-01-22 Sat 02:27]
  #+BEGIN: clocktable :scope file :block 2021-08-13
  #+CAPTION: Clock summary at [2021-08-13 Fri 23:48], for Friday, August 13, 2021.
  | Headline     | Time   |
  |--------------+--------|
  | *Total time* | *8:19* |
  |--------------+--------|
  | 数学         | 8:19   |
  #+END

* DONE [2021-08-12 Sun]
CLOSED: [2022-01-22 Sat 02:27]
  #+BEGIN: clocktable :scope file :block 2021-08-12
  #+CAPTION: Clock summary at [2021-08-13 Fri 00:24], for Thursday, August 12, 2021.
  | Headline     |   Time |
  |--------------+--------|
  | *Total time* | *7:36* |
  |--------------+--------|
  | 数学         |   7:27 |
  | 理论力学     |   0:09 |
  #+END

* DONE [2021-08-11 Sun]
CLOSED: [2022-01-22 Sat 02:27]
  #+BEGIN: clocktable :scope file :block 2021-08-11
  #+CAPTION: Clock summary at [2021-08-12 Thu 00:10], for Wednesday, August 11, 2021.
  | Headline     |    Time |
  |--------------+---------|
  | *Total time* | *10:05* |
  |--------------+---------|
  | 数学         |    5:50 |
  | 理论力学     |    4:15 |
  #+END

* DONE [2021-08-10 Sun]
CLOSED: [2022-01-22 Sat 02:27]
- State "DONE"       from "NEXT"       [2022-01-22 Sat 02:27]
  #+BEGIN: clocktable :scope file :block 2021-08-10
  #+CAPTION: Clock summary at [2021-08-10 Tue 22:50], for Tuesday, August 10, 2021.
  | Headline     | Time   |
  |--------------+--------|
  | *Total time* | *7:13* |
  |--------------+--------|
  | 数学         | 7:13   |
  #+END

* NEXT [2021-08-08 Sun]
  #+BEGIN: clocktable :scope file :block 2021-08-08
  #+CAPTION: Clock summary at [2021-08-08 Sun 22:13], for Sunday, August 08, 2021.
  | Headline     |   Time |
  |--------------+--------|
  | *Total time* | *7:32* |
  |--------------+--------|
  | 数学         |   6:20 |
  | 理论力学     |   0:19 |
  | 英语         |   0:53 |
  #+END

* NEXT [2021-08-07 Thu]
  #+BEGIN: clocktable :scope file :block 2021-08-07
  #+CAPTION: Clock summary at [2021-08-08 Sun 01:38], for Saturday, August 07, 2021.
  | Headline     |   Time |
  |--------------+--------|
  | *Total time* | *9:08* |
  |--------------+--------|
  | 数学         |   2:54 |
  | 理论力学     |   5:30 |
  | 英语         |   0:44 |
  #+END

* NEXT [2021-08-06 Thu]
  #+BEGIN: clocktable :scope file :block 2021-08-06
  #+CAPTION: Clock summary at [2021-08-07 Sat 01:43], for Friday, August 06, 2021.
  | Headline     | Time   |      |
  |--------------+--------+------|
  | *Total time* | *5:28* |      |
  |--------------+--------+------|
  | 时间志       | 5:28   |      |
  | \_  数学     |        | 5:28 |
  #+END

* NEXT [2021-08-05 Thu]
  #+BEGIN: clocktable :scope file :block 2021-08-05
  #+CAPTION: Clock summary at [2021-08-06 Fri 02:13], for Thursday, August 05, 2021.
  | Headline     | Time    |       |
  |--------------+---------+-------|
  | *Total time* | *11:56* |       |
  |--------------+---------+-------|
  | 时间志       | 11:56   |       |
  | \_  数学     |         | 11:56 |
  #+END

* NEXT [2021-08-04 Wed]
  #+BEGIN: clocktable :scope file :block 2021-08-04
  #+CAPTION: Clock summary at [2021-08-05 Thu 10:37], for Wednesday, August 04, 2021.
  | Headline     | Time    |       |
  |--------------+---------+-------|
  | *Total time* | *12:41* |       |
  |--------------+---------+-------|
  | 时间志       | 12:41   |       |
  | \_  数学     |         | 12:41 |
  #+END

* NEXT [2021-08-03 Tue]
  :LOGBOOK:
  CLOCK: [2021-08-02 Mon 18:20]--[2021-08-02 Mon 20:44] =>  2:24
  :END:
  #+BEGIN: clocktable :scope file :block 2021-08-03
  #+CAPTION: Clock summary at [2021-08-03 Tue 22:18], for Tuesday, August 03, 2021.
  | Headline     | Time   |      |
  |--------------+--------+------|
  | *Total time* | *9:22* |      |
  |--------------+--------+------|
  | 时间志       | 9:22   |      |
  | \_  数学     |        | 9:22 |
  #+END

* NEXT [2021-08-02 Mon]
  :LOGBOOK:
  CLOCK: [2021-08-02 Mon 18:20]--[2021-08-02 Mon 20:44] =>  2:24
  :END:
  #+BEGIN: clocktable :scope file :block 2021-08-02
  #+CAPTION: Clock summary at [2021-08-02 Mon 23:03], for Monday, August 02, 2021.
  | Headline         |    Time |      |
  |------------------+---------+------|
  | *Total time*     | *10:18* |      |
  |------------------+---------+------|
  | 时间志           |    7:54 |      |
  | \_  数学         |         | 7:54 |
  | [2021-08-02 Mon] |    2:24 |      |
  #+END

* [2021-08-01 Tue]
  #+BEGIN: clocktable :scope file :block 2021-08-01
  #+CAPTION: Clock summary at [2021-08-01 Sun 22:15], for Sunday, August 01, 2021.
  | Headline     | Time   |      |
  |--------------+--------+------|
  | *Total time* | *7:30* |      |
  |--------------+--------+------|
  | 时间志       | 7:30   |      |
  | \_  数学     |        | 7:30 |
  #+END

* [2021-07-31 Sat]
  #+BEGIN: clocktable :scope file :block 2021-07-31
  #+CAPTION: Clock summary at [2021-07-31 Sat 22:24], for Saturday, July 31, 2021.
  | Headline     |   Time |      |
  |--------------+--------+------|
  | *Total time* | *7:43* |      |
  |--------------+--------+------|
  | 时间志       |   4:26 |      |
  | \_  数学     |        | 4:26 |
  | 理论力学     |   3:17 |      |
  #+END

* [2021-07-30 Tue]
  #+BEGIN: clocktable :scope file :block 2021-07-30
  #+CAPTION: Clock summary at [2021-07-31 Sat 00:15], for Friday, July 30, 2021.
  | Headline     | Time   |      |
  |--------------+--------+------|
  | *Total time* | *9:04* |      |
  |--------------+--------+------|
  | 时间志       | 9:04   |      |
  | \_  数学     |        | 9:04 |
  #+END

* [2021-07-26 Mon]
  #+BEGIN: clocktable :scope file :block 2021-07-26
  #+CAPTION: Clock summary at [2021-07-26 Mon 18:00], for Monday, July 26, 2021.
  | Headline       | Time   |      |
  |----------------+--------+------|
  | *Total time*   | *3:48* |      |
  |----------------+--------+------|
  | 时间志         | 3:48   |      |
  | \_  JavaScript |        | 3:48 |
  #+END

* [2021-07-25 Sun]
  #+BEGIN: clocktable :scope file :block 2021-07-25
  #+CAPTION: Clock summary at [2021-07-25 Sun 20:24], for Sunday, July 25, 2021.
  | Headline     | Time   |      |
  |--------------+--------+------|
  | *Total time* | *4:20* |      |
  |--------------+--------+------|
  | 时间志       | 4:20   |      |
  | \_  工作     |        | 4:20 |
  #+END

* [2021-07-24 Sat]
  #+BEGIN: clocktable :scope file :block 2021-07-24
  #+CAPTION: Clock summary at [2021-07-24 Sat 23:34], for Saturday, July 24, 2021.
  | Headline     | Time   |      |
  |--------------+--------+------|
  | *Total time* | *8:04* |      |
  |--------------+--------+------|
  | 时间志       | 8:04   |      |
  | \_  工作     |        | 8:04 |
  #+END

* [2021-07-23 Fri]
  #+BEGIN: clocktable :scope file :block 2021-07-23
  #+CAPTION: Clock summary at [2021-07-23 Fri 23:41], for Friday, July 23, 2021.
  | Headline     | Time   |      |
  |--------------+--------+------|
  | *Total time* | *5:27* |      |
  |--------------+--------+------|
  | 时间志       | 5:27   |      |
  | \_  工作     |        | 5:27 |
  #+END

* [2021-07-22 Thu]
  #+BEGIN: clocktable :scope file :block 2021-07-22
  #+CAPTION: Clock summary at [2021-07-22 Thu 22:01], for Thursday, July 22, 2021.
  | Headline     | Time   |      |
  |--------------+--------+------|
  | *Total time* | *5:17* |      |
  |--------------+--------+------|
  | 时间志       | 5:17   |      |
  | \_  工作     |        | 5:17 |
  #+END

* [2021-07-20 Tue]
  #+BEGIN: clocktable :scope file :block 2021-07-20
  #+CAPTION: Clock summary at [2021-07-20 Tue 22:49], for Tuesday, July 20, 2021.
  | Headline     | Time   |      |
  |--------------+--------+------|
  | *Total time* | *6:42* |      |
  |--------------+--------+------|
  | 时间志       | 6:42   |      |
  | \_  方法论   |        | 2:19 |
  | \_  工作     |        | 4:23 |
  #+END

* [2021-07-19 Mon]
  #+BEGIN: clocktable :scope file :block 2021-07-19
  #+CAPTION: Clock summary at [2021-07-20 Tue 00:06], for Monday, July 19, 2021.
  | Headline     | Time   |      |
  |--------------+--------+------|
  | *Total time* | *6:29* |      |
  |--------------+--------+------|
  | 时间志       | 6:29   |      |
  | \_  工作     |        | 6:29 |
  #+END

* [2021-07-04 Sun]
  #+BEGIN: clocktable :scope file :block 2021-07-04
  #+CAPTION: Clock summary at [2021-07-04 Sun 22:14], for Sunday, July 04, 2021.
  | Headline     | Time   |      |
  |--------------+--------+------|
  | *Total time* | *7:21* |      |
  |--------------+--------+------|
  | 时间志       | 7:21   |      |
  | \_  方法论   |        | 0:32 |
  | \_  工作     |        | 6:49 |
  #+END

* [2021-07-03 Sat]
  #+BEGIN: clocktable :scope file :block 2021-07-03
  #+CAPTION: Clock summary at [2021-07-04 Sun 00:43], for Saturday, July 03, 2021.
  | Headline     | Time   |      |
  |--------------+--------+------|
  | *Total time* | *4:05* |      |
  |--------------+--------+------|
  | 时间志       | 4:05   |      |
  | \_  工作     |        | 3:10 |
  | \_  跑步锻炼 |        | 0:55 |
  #+END

* [2020-09-21 Mon]
  #+BEGIN: clocktable :scope file :block 2020-09-21
  #+CAPTION: Clock summary at [2020-09-21 Mon 17:05], for Monday, September 21, 2020.
  | Headline     | Time   |
  |--------------+--------|
  | *Total time* | *0:00* |
  #+END
* [2020-09-07 Mon]
  #+BEGIN: clocktable :scope file :block 2020-09-07
  #+CAPTION: Clock summary at [2020-09-07 Mon 22:00], for Monday, September 07, 2020.
  | Headline          | Time    |      |
  |-------------------+---------+------|
  | *Total time*      | *10:21* |      |
  |-------------------+---------+------|
  | 时间志            | 10:21   |      |
  | \_  方法论        |         | 2:12 |
  | \_  Bilibili 视频 |         | 6:00 |
  | \_  洗漱用餐午睡  |         | 2:09 |
  #+END
* [2020-09-06 Sun]
  #+BEGIN: clocktable :scope file :block 2020-09-06
  #+CAPTION: Clock summary at [2020-09-06 Sun 21:17], for Sunday, September 06, 2020.
  | Headline          | Time   |      |
  |-------------------+--------+------|
  | *Total time*      | *8:02* |      |
  |-------------------+--------+------|
  | 时间志            | 8:02   |      |
  | \_  方法论        |        | 1:28 |
  | \_  Bilibili 视频 |        | 4:28 |
  | \_  洗漱用餐      |        | 2:06 |
  #+END
* [2020-09-05 Sat]
  #+BEGIN: clocktable :scope file :block 2020-09-05
  #+CAPTION: Clock summary at [2020-09-06 Sun 23:13], for Saturday, September 05, 2020.
  | Headline          | Time   |      |
  |-------------------+--------+------|
  | *Total time*      | *8:08* |      |
  |-------------------+--------+------|
  | 时间志            | 8:08   |      |
  | \_  方法论        |        | 2:41 |
  | \_  Bilibili 视频 |        | 4:15 |
  | \_  超市          |        | 1:12 |
  #+END


* 手机复盘知识法

| 时间                   | 科目       | 知识点关键词           | 具体解释 | 类别 | 出现次数 |
|------------------------+------------+------------------------+----------+------+----------|
| <2020-08-01 Sat 14:07> | JavaScript | self-invoking function |          |      |        1 |
